<?php
////TODO:Крон для админки - протестировать
//
//TODO: SEO
//TODO: Профиль пользователя и пароль - личный
//TODO: Компонента для работы с Файлами
//TODO: Компонента для работы с Изображениями
//
//TODO:Виджет Селект2
//TODO:Почтовая компонента
//TODO:Меню Левое в админке автоматизация
//TODO:Базовый модуль Продаж
//TODO:Работа с Изображениями Модуль
//TODO:Работа с файлами  Модуль
//TODO:СЕО
//TODO:ЛОГ

//TODO:Переводы
1. Нужно переработать базу данных, посмотреть базовое представление в Yii;
2. Добавить автоматическое добавление переводов в базу .
3.Создать, если возможно автоматическое обновление в файлах, при редактировании .
//TODO: Сделать полный рефакторинг и проверить состояние системы вцелом ядро, общам и админка
//TODO: На базе модуля новостей и страниц для пользовательской доработать все необходимые связи