Перчислю все:
1. Карта XML
редактирование записей (это новое): поля - УРЛ, время обновления, влк/выкл, добавить удалить
генерация карты
добавление записей в базу данных карты

3. Генерация микроформатов
Для модуля (пример новости)
для списка
для записи

5. Графы
Генерация и наполнение

7. Генерация и переопределение и наполнение для любого УРЛ
мета, микро, граф

8. Виджет для наполнения
мета, микро, граф


///
Ручные ссылки - пользовательская часть
1. Генерация карты XML
2. Генерация графа
3. Генерация метаданных